[
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Massachusetts treats rent increases during a fixed term as a material change that both parties must sign. Point the landlord to Chapter 186 ยง12 which requires mutual agreement for any change before renewal. Ask them to provide an addendum and emphasize that unilateral hikes are unenforceable.",
    "createdAt": "2024-10-03T08:10:00.000Z",
    "updatedAt": "2024-10-03T08:45:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Document every response time and request a humidity test. The Board of Health inspection triggered compensation for us within 10 days.",
    "createdAt": "2024-09-22T10:05:00.000Z",
    "updatedAt": "2024-09-22T10:05:00.000Z",
    "isAccepted": true
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Under M.G.L. Chapter 186 ยง15B, Massachusetts landlords can only collect first month, last month, security deposit (max one month), and lock change fee. Your landlord is violating the law by requesting two months. Send a written request citing this statute and demand a refund of the excess amount within 30 days.",
    "createdAt": "2024-10-06T14:30:00.000Z",
    "updatedAt": "2024-10-06T14:30:00.000Z",
    "isAccepted": true
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Same thing happened to me! I reported to the Attorney General's office and got triple damages. Keep all receipts and communication records.",
    "createdAt": "2024-10-07T09:15:00.000Z",
    "updatedAt": "2024-10-07T09:15:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Massachusetts has an implied warranty of habitability. Landlords must maintain heating, plumbing, and electrical systems regardless of what the lease says. Under Chapter 239 ยง8A, you can withhold rent or repair and deduct if the landlord fails to fix within 14 days of written notice. Document everything with photos and certified mail.",
    "createdAt": "2024-10-16T11:00:00.000Z",
    "updatedAt": "2024-10-16T11:00:00.000Z",
    "isAccepted": true
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Call 311 and request a housing inspection. They came within 48 hours for us and the landlord suddenly became very responsive after receiving the city notice.",
    "createdAt": "2024-10-17T08:45:00.000Z",
    "updatedAt": "2024-10-17T08:45:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Flat utility fees are legal but must be disclosed before signing. However, if the fee significantly exceeds actual costs, you may have a claim for unfair practices under Chapter 93A. Request utility bills for the past 12 months to verify the fee is reasonable. If they refuse, this is a red flag.",
    "createdAt": "2024-10-26T15:20:00.000Z",
    "updatedAt": "2024-10-26T15:20:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "I negotiated my flat fee down by asking for actual bills. Turns out they were overcharging by $80/month. Always ask for documentation!",
    "createdAt": "2024-10-27T10:30:00.000Z",
    "updatedAt": "2024-10-27T10:30:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Auto-renewal clauses are enforceable in Massachusetts, but the 90-day notice requirement is unusually long. Most courts expect 30-60 days. You can try to negotiate this down. The 15% rent increase cap is not illegal but is aggressive. Get any negotiated changes in writing as a lease addendum signed by both parties.",
    "createdAt": "2024-11-06T09:00:00.000Z",
    "updatedAt": "2024-11-06T09:00:00.000Z",
    "isAccepted": true
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Set a calendar reminder 100 days before your lease ends! I missed the window once and got stuck with a 10% increase. Never again.",
    "createdAt": "2024-11-07T14:15:00.000Z",
    "updatedAt": "2024-11-07T14:15:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "Massachusetts requires landlords to provide proper notice before eviction. For non-payment, you're entitled to a 14-day notice to quit. For lease violations, you get 30 days to cure. Any \"immediate termination\" clause is unenforceable. Do not leave voluntarily - make them go through the court process where you'll have additional protections.",
    "createdAt": "2024-11-08T11:30:00.000Z",
    "updatedAt": "2024-11-08T11:30:00.000Z",
    "isAccepted": true
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Contact Greater Boston Legal Services immediately - they offer free representation for eviction cases. They helped me stay in my apartment when my landlord tried illegal self-help eviction.",
    "createdAt": "2024-11-09T16:45:00.000Z",
    "updatedAt": "2024-11-09T16:45:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "lawyer_opinion",
    "content": "If all roommates are on the lease, you're jointly and severally liable - meaning the landlord can pursue any one of you for the full rent. Your dispute with your roommate is a civil matter separate from your landlord obligations. Consider small claims court (up to $7,000) if your roommate won't pay their share. Document all payments you've made.",
    "createdAt": "2024-11-12T10:00:00.000Z",
    "updatedAt": "2024-11-12T10:00:00.000Z",
    "isAccepted": false
  },
  {
    "postId": null,
    "authorId": null,
    "answerType": "community_answer",
    "content": "Been there! Use Venmo or Zelle so you have a clear paper trail. We also created a shared spreadsheet for all expenses. When my roommate stopped paying, I had solid evidence for small claims court.",
    "createdAt": "2024-11-13T08:30:00.000Z",
    "updatedAt": "2024-11-13T08:30:00.000Z",
    "isAccepted": false
  }
]